def area(a,b):
    '''
    Возвращает площадь прямоугольника 
    
            Параметры: 
                    a (float): длина первой стороны
                    b (float): длина второй стороны
            
            Возвращаемое значение:
                    area (float): площадь прямоугольника co сторонами a и b
    '''
    return a * b

def perimeter(a,b):
    '''
    Возвращает периметр прямоугольника
    
            Параметры:
                    a (float): длина первой стороны
                    b (float): длина второй стороны
            
            Возвращаемое значение:
                    perimeter (float): периметр прямоугольника co сторонами a и b
    '''
    return 2 * (a + b)

