
def area(a):
    '''
    Возвращает площадь квадрата
    
            Параметры:
                    a (float): длина стороны квадрата
                    
            Возвращаемое число:
                    area (float): площадь квадрата co стороной a
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата
    
            Параметры:
                    a (float): длина стороны квадрата
                    
            Возвращаемое значение:
                    perimeter (float): периметр квадрата co стороной a
    '''
    return 4 * a
