def area(a, h):
    '''
    Возвращает площадь треугольника
    
            Параметры:
                    a (float): длина основания треугольника
                    h (float): высота треугольника
            
            Возвращаемое значение:
                    area (float): площадь треугольника a,h
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника
    
            Параметры:
                    a (float): длина первой стороны
                    b (float): длина второй стороны
                    c (float): длина третьей стороны
            
            Возвращаемое значение:
                    perimeter (float): периметр треугольника a,b,c
    '''
    return a + b + c
